# Lecture 6 Dictionaries and Dataframes
- Student Name: Lakshay Goyal
- Division: A

# Dictionaries

In [1]:
myself = {"name": "Lakshay Goyal",
         "age": 19,
         "division": "A",
         "favorite_movies": ["Spiderman", "Marvel", "Inception"],
         "favorite_songs": ["Aadat", "Aabaad", "Tere Bin"],
         }
myself

{'name': 'Lakshay Goyal',
 'age': 19,
 'division': 'A',
 'favorite_movies': ['Spiderman', 'Marvel', 'Inception'],
 'favorite_songs': ['Aadat', 'Aabaad', 'Tere Bin']}

In [2]:
# Add new key
myself["favorite_foods"] = ["Pav bhaji", "Pizza", "Pasta"]
myself

{'name': 'Lakshay Goyal',
 'age': 19,
 'division': 'A',
 'favorite_movies': ['Spiderman', 'Marvel', 'Inception'],
 'favorite_songs': ['Aadat', 'Aabaad', 'Tere Bin'],
 'favorite_foods': ['Pav bhaji', 'Pizza', 'Pasta']}

In [3]:
myself["division"] = "E"
myself

{'name': 'Lakshay Goyal',
 'age': 19,
 'division': 'E',
 'favorite_movies': ['Spiderman', 'Marvel', 'Inception'],
 'favorite_songs': ['Aadat', 'Aabaad', 'Tere Bin'],
 'favorite_foods': ['Pav bhaji', 'Pizza', 'Pasta']}

In [4]:
# Add value to the list of movies
myself["favorite_movies"].append("GodFather")
myself

{'name': 'Lakshay Goyal',
 'age': 19,
 'division': 'E',
 'favorite_movies': ['Spiderman', 'Marvel', 'Inception', 'GodFather'],
 'favorite_songs': ['Aadat', 'Aabaad', 'Tere Bin'],
 'favorite_foods': ['Pav bhaji', 'Pizza', 'Pasta']}

In [5]:
# Remove the "Aadat song"
myself["favorite_songs"].remove("Aadat")
myself

{'name': 'Lakshay Goyal',
 'age': 19,
 'division': 'E',
 'favorite_movies': ['Spiderman', 'Marvel', 'Inception', 'GodFather'],
 'favorite_songs': ['Aabaad', 'Tere Bin'],
 'favorite_foods': ['Pav bhaji', 'Pizza', 'Pasta']}

In [6]:
#Get Index number
myself["favorite_movies"] .index("Marvel")

1

In [7]:
# Count total keys
total_keys_in_myself = len(myself)
total_keys_in_myself

6

In [8]:
# Count total values in list
total_movies_in_myself = len(myself["favorite_movies"])
total_movies_in_myself

4

In [9]:
div_scores_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh"],
                         "math_scores": [20,56,76,78,90],
                         "chemistry_scores": [32,36,78,23,100],
                         "information_technology_scores": [34,6,88,100,45],
                         "physics_scores": [6,88,48,90,25]
                         }
                         
div_emails_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh", "Abdul"],
                           "student_email": ["Jay@gmail.com", "Aaryan@gmail.com", "Sahil@gmail.com","Riya@gmail.com","Shubh@gmail.com", "Abdual@gmail.com"]
                         }

# Dataframes

In [10]:
# Setup
import pandas as pd

In [11]:
# Convert the score dictionary into a dataframe
scores_df = pd.DataFrame(div_scores_dictionary)
scores_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores
0,Jay,20,32,34,6
1,Aaryan,56,36,6,88
2,Sahil,76,78,88,48
3,Riya,78,23,100,90
4,Shubh,90,100,45,25

In [12]:
# First 3 Rows in dataframe
scores_df.head(3)

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores
0,Jay,20,32,34,6
1,Aaryan,56,36,6,88
2,Sahil,76,78,88,48

In [13]:
# 3 Random Rows from the dataframe
scores_df.sample(3)

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores
3,Riya,78,23,100,90
4,Shubh,90,100,45,25
1,Aaryan,56,36,6,88

In [14]:
# Create a column called total score that added the scores for all the 4 subjects
scores_df["total_score"] = scores_df["math_scores"]+ scores_df["chemistry_scores"]+scores_df["information_technology_scores"]+scores_df["physics_scores"]
scores_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score
0,Jay,20,32,34,6,92
1,Aaryan,56,36,6,88,186
2,Sahil,76,78,88,48,290
3,Riya,78,23,100,90,291
4,Shubh,90,100,45,25,260

In [15]:
# Create a column called "average score"
scores_df["average_score"] = scores_df["total_score"]/4
scores_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score
0,Jay,20,32,34,6,92,23.00
1,Aaryan,56,36,6,88,186,46.50
2,Sahil,76,78,88,48,290,72.50
3,Riya,78,23,100,90,291,72.75
4,Shubh,90,100,45,25,260,65.00

In [16]:
# Making our score in csv file
scores_df.to_csv("Report Card.csv")

In [17]:
# Making an insights dataframe
insights_df = scores_df.describe()
insights_df

,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score
count,5.00000,5.00000,5.000000,5.000000,5.00000,5.000000
mean,64.00000,53.80000,54.600000,51.400000,223.80000,55.950000
std,27.45906,33.39461,38.907583,37.413901,85.15985,21.289962
min,20.00000,23.00000,6.000000,6.000000,92.00000,23.000000
25%,56.00000,32.00000,34.000000,25.000000,186.00000,46.500000
50%,76.00000,36.00000,45.000000,48.000000,260.00000,65.000000
75%,78.00000,78.00000,88.000000,88.000000,290.00000,72.500000
max,90.00000,100.00000,100.000000,90.000000,291.00000,72.750000

In [18]:
insights_df.to_csv("Report Card Insights.csv")

# Lecture 7 Starts Here

In [19]:
# Add a column that tells if a student passed or failed
scores_df.loc[scores_df["average_score"]>=35, "status"] = "pass"
scores_df.loc[scores_df["average_score"]<35, "status"] = "fail"
scores_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score,status
0,Jay,20,32,34,6,92,23.00,fail
1,Aaryan,56,36,6,88,186,46.50,pass
2,Sahil,76,78,88,48,290,72.50,pass
3,Riya,78,23,100,90,291,72.75,pass
4,Shubh,90,100,45,25,260,65.00,pass

# Character Grade

In [28]:
scores_df.loc[scores_df["average_score"] >=90, "character_grade"] = "A"
scores_df.loc[(scores_df["average_score"] >=70) & (scores_df["average_score"] < 90), "character_grade"] = "B"
scores_df.loc[(scores_df["average_score"] >=50) & (scores_df["average_score"] < 70), "character_grade"] = "C"
scores_df.loc[(scores_df["average_score"] >=35) & (scores_df["average_score"] < 50), "character_grade"] = "D"
scores_df.loc[scores_df["average_score"] < 35, "character_grade"] = "F"
scores_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score,status,character_grade
0,Jay,20,32,34,6,92,23.00,fail,F
1,Aaryan,56,36,6,88,186,46.50,pass,D
2,Sahil,76,78,88,48,290,72.50,pass,B
3,Riya,78,23,100,90,291,72.75,pass,B
4,Shubh,90,100,45,25,260,65.00,pass,C

# Summarizing Data

In [34]:
# Summary that tells me the totalstudents that passed or failed
pass_fail_df = scores_df.groupby(["status"]).agg(total_students =("status", "count"))
pass_fail_df

        total_students
status
fail                 1
pass                 4

In [35]:
# Summary that tells me the total students that passed and failed and character grade
pass_fail_df = scores_df.groupby(["status", "character_grade"]).agg(total_students = ("status", "count"))                                                                
pass_fail_df

                        total_students
status character_grade
fail   F                             1
pass   B                             2
       C                             1
       D                             1

In [49]:
# Summary that tells me the character grade and tell me the avg. total score
pass_fail_df = scores_df.groupby(["status", "character_grade"]).agg(total_students = ("character_grade", "count"), 
                                                                    avg_total_score = ("total_score", "mean"), 
                                                                    lowest_math_score = ("math_scores", "min"))
                                                                    
pass_fail_df

                        total_students  avg_total_score  lowest_math_score
status character_grade
fail   F                             1             92.0                 20
pass   B                             2            290.5                 76
       C                             1            260.0                 90
       D                             1            186.0                 56

# Challenge - Provide a Summary that tells us average physics, chemistry and maths

In [24]:
character_df = scores_df.groupby(["character_grade"]).agg(avg_phy_score = ("physics_scores", "mean"),
                                                         avg_chem_score = ("chemistry_scores", "mean"),
                                                         avg_math_score = ("math_scores", "mean"))
character_df

                 avg_phy_score  avg_chem_score  avg_math_score
character_grade
F                        62.75           59.25              75

# Filtering Data

In [51]:
# We want to see only students who passed
only_passed_df = scores_df.loc[scores_df["status"]== "pass"]
only_passed_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score,status,character_grade
1,Aaryan,56,36,6,88,186,46.50,pass,D
2,Sahil,76,78,88,48,290,72.50,pass,B
3,Riya,78,23,100,90,291,72.75,pass,B
4,Shubh,90,100,45,25,260,65.00,pass,C

In [52]:
# Alternative approach 
only_passed_df = scores_df.loc[scores_df["average_score"] >=35]
only_passed_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score,status,character_grade
1,Aaryan,56,36,6,88,186,46.50,pass,D
2,Sahil,76,78,88,48,290,72.50,pass,B
3,Riya,78,23,100,90,291,72.75,pass,B
4,Shubh,90,100,45,25,260,65.00,pass,C

In [56]:
#Only show students who passed and also scored greater than or equal to 200

pass_200_df = scores_df.loc[(scores_df["status"] == "pass") & (scores_df["total_score"] >= 200)]
pass_200_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score,status,character_grade
2,Sahil,76,78,88,48,290,72.50,pass,B
3,Riya,78,23,100,90,291,72.75,pass,B
4,Shubh,90,100,45,25,260,65.00,pass,C

In [59]:
# Only show students who either received either A grade or B grade
a_b_grade_df = scores_df[(scores_df["character_grade"] == "A") | (scores_df["character_grade"] == "B")]
a_b_grade_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,total_score,average_score,status,character_grade
2,Sahil,76,78,88,48,290,72.50,pass,B
3,Riya,78,23,100,90,291,72.75,pass,B